iwasz/mcuxsdk-middleware-bootloader/targets/LPC54S018/src/startup/gcc/startup_LPC54S018.S
/* ---------------------------------------------------------------------------------------*/
/* @file:    startup_LPC54S018.S                                                           */
/* @purpose: CMSIS Cortex-M4 Core Device Startup File                                     */
/*           LPC54S018                                                                     */
/* @version: 1.0                                                                          */
/* @date:    2018-4-20                                                                     */

/* ---------------------------------------------------------------------------------------*/
/*                                                                                        */
/* Copyright (c) 1997-2015 Freescale Semiconductor, Inc.                                  */
/* Copyright 2016-2018 NXP                                                                */
/* All rights reserved.                                                                   */
/*                                                                                        */
/* SPDX-License-Identifier: BSD-3-Clause                                                  */
/******************************************************************************************/
/* Version: GCC for ARM Embedded Processors                                               */
/******************************************************************************************/


    .syntax unified
    .arch armv7-m

    .section .isr_vector, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   __StackTop                                      /* Top of Stack */
    .long   Reset_Handler                                   /* Reset Handler */
    .long   NMI_Handler                                     /* NMI Handler*/
    .long   HardFault_Handler                               /* Hard Fault Handler*/
    .long   MemManage_Handler                               /* MPU Fault Handler*/
    .long   BusFault_Handler                                /* Bus Fault Handler*/
    .long   UsageFault_Handler                              /* Usage Fault Handler*/
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   0xEDDC94BD                                      /* Enhanced image marker, set to 0x0 for legacy boot */
    .long   0x160                                           /* Pointer to enhanced boot block, set to 0x0 for legacy boot */
    .long   SVC_Handler                                     /* SVCall Handler*/
    .long   DebugMon_Handler                                /* Debug Monitor Handler*/
    .long   0                                               /* Reserved*/
    .long   PendSV_Handler                                  /* PendSV Handler*/
    .long   SysTick_Handler                                 /* SysTick Handler*/

    /* External Interrupts */
    .long   WDT_BOD_IRQHandler                              /* Windowed watchdog timer, Brownout detect */
    .long   DMA0_IRQHandler                                 /* DMA controller */
    .long   GINT0_IRQHandler                                /* GPIO group 0 */
    .long   GINT1_IRQHandler                                /* GPIO group 1 */
    .long   PIN_INT0_IRQHandler                             /* Pin interrupt 0 or pattern match engine slice 0 */
    .long   PIN_INT1_IRQHandler                             /* Pin interrupt 1or pattern match engine slice 1 */
    .long   PIN_INT2_IRQHandler                             /* Pin interrupt 2 or pattern match engine slice 2 */
    .long   PIN_INT3_IRQHandler                             /* Pin interrupt 3 or pattern match engine slice 3 */
    .long   UTICK0_IRQHandler                               /* Micro-tick Timer */
    .long   MRT0_IRQHandler                                 /* Multi-rate timer */
    .long   CTIMER0_IRQHandler                              /* Standard counter/timer CTIMER0 */
    .long   CTIMER1_IRQHandler                              /* Standard counter/timer CTIMER1 */
    .long   SCT0_IRQHandler                                 /* SCTimer/PWM */
    .long   CTIMER3_IRQHandler                              /* Standard counter/timer CTIMER3 */
    .long   FLEXCOMM0_IRQHandler                            /* Flexcomm Interface 0 (USART, SPI, I2C, FLEXCOMM) */
    .long   FLEXCOMM1_IRQHandler                            /* Flexcomm Interface 1 (USART, SPI, I2C, FLEXCOMM) */
    .long   FLEXCOMM2_IRQHandler                            /* Flexcomm Interface 2 (USART, SPI, I2C, FLEXCOMM) */
    .long   FLEXCOMM3_IRQHandler                            /* Flexcomm Interface 3 (USART, SPI, I2C, FLEXCOMM) */
    .long   FLEXCOMM4_IRQHandler                            /* Flexcomm Interface 4 (USART, SPI, I2C, FLEXCOMM) */
    .long   FLEXCOMM5_IRQHandler                            /* Flexcomm Interface 5 (USART, SPI, I2C,, FLEXCOMM) */
    .long   FLEXCOMM6_IRQHandler                            /* Flexcomm Interface 6 (USART, SPI, I2C, I2S,, FLEXCOMM) */
    .long   FLEXCOMM7_IRQHandler                            /* Flexcomm Interface 7 (USART, SPI, I2C, I2S,, FLEXCOMM) */
    .long   ADC0_SEQA_IRQHandler                            /* ADC0 sequence A completion. */
    .long   ADC0_SEQB_IRQHandler                            /* ADC0 sequence B completion. */
    .long   ADC0_THCMP_IRQHandler                           /* ADC0 threshold compare and error. */
    .long   DMIC0_IRQHandler                                /* Digital microphone and DMIC subsystem */
    .long   HWVAD0_IRQHandler                               /* Hardware Voice Activity Detector */
    .long   USB0_NEEDCLK_IRQHandler                         /* USB Activity Wake-up Interrupt */
    .long   USB0_IRQHandler                                 /* USB device */
    .long   RTC_IRQHandler                                  /* RTC alarm and wake-up interrupts */
    .long   FLEXCOMM10_IRQHandler                           /* Flexcomm Interface 10 (SPI, FLEXCOMM) */
    .long   Reserved47_IRQHandler                           /* Reserved interrupt */
    .long   PIN_INT4_IRQHandler                             /* Pin interrupt 4 or pattern match engine slice 4 int */
    .long   PIN_INT5_IRQHandler                             /* Pin interrupt 5 or pattern match engine slice 5 int */
    .long   PIN_INT6_IRQHandler                             /* Pin interrupt 6 or pattern match engine slice 6 int */
    .long   PIN_INT7_IRQHandler                             /* Pin interrupt 7 or pattern match engine slice 7 int */
    .long   CTIMER2_IRQHandler                              /* Standard counter/timer CTIMER2 */
    .long   CTIMER4_IRQHandler                              /* Standard counter/timer CTIMER4 */
    .long   RIT_IRQHandler                                  /* Repetitive Interrupt Timer */
    .long   SPIFI0_IRQHandler                               /* SPI flash interface */
    .long   FLEXCOMM8_IRQHandler                            /* Flexcomm Interface 8 (USART, SPI, I2C, FLEXCOMM) */
    .long   FLEXCOMM9_IRQHandler                            /* Flexcomm Interface 9 (USART, SPI, I2C, FLEXCOMM) */
    .long   SDIO_IRQHandler                                 /* SD/MMC  */
    .long   CAN0_IRQ0_IRQHandler                            /* CAN0 interrupt0 */
    .long   CAN0_IRQ1_IRQHandler                            /* CAN0 interrupt1 */
    .long   CAN1_IRQ0_IRQHandler                            /* CAN1 interrupt0 */
    .long   CAN1_IRQ1_IRQHandler                            /* CAN1 interrupt1 */
    .long   USB1_IRQHandler                                 /* USB1 interrupt */
    .long   USB1_NEEDCLK_IRQHandler                         /* USB1 activity */
    .long   ETHERNET_IRQHandler                             /* Ethernet */
    .long   ETHERNET_PMT_IRQHandler                         /* Ethernet power management interrupt */
    .long   ETHERNET_MACLP_IRQHandler                       /* Ethernet MAC interrupt */
    .long   Reserved68_IRQHandler                           /* Reserved interrupt */
    .long   LCD_IRQHandler                                  /* LCD interrupt */
    .long   SHA_IRQHandler                                  /* SHA interrupt */
    .long   SMARTCARD0_IRQHandler                           /* Smart card 0 interrupt */
    .long   SMARTCARD1_IRQHandler                           /* Smart card 1 interrupt */
    .long   ESPI_IRQHandler                                 /* ESPI interrupt */
    .long   PUF_IRQHandler                                  /* PUF interrupt */

